engineFoam_tutorial/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// blockMeshDict info

vertices
(
    (-0.04 -0.005 0)
    (0.04 -0.005 0)
    (0.04 0.035 0)
    (-0.04 0.035 0)
    (-0.04 -0.005 0.01)
    (0.04 -0.005 0.01)
    (0.04 0.035 0.01)
    (-0.04 0.035 0.01)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (10 5 1) simpleGrading (1 1 1)
);

edges
();
patches
();

// end blockMeshDict info

