engineFoam_tutorial/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

patches
(
    {
        name  inlet;
        patchInfo
        {
            type    wall;
        }
        constructFrom patches;
        patches       (auto0);
    }
    {
        name  outlet;
        patchInfo
        {
            type    wall;
        }
        constructFrom patches;
        patches       (auto6);
    }
    {
        name  valveInlet;
        patchInfo
        {
            type    wall;
        }
        constructFrom patches;
        patches       (auto8 auto10 auto20 auto26);
    }
    {
        name  valveOutlet;
        patchInfo
        {
            type    wall;
        }
        constructFrom patches;
        patches       (auto19 auto23 auto24 auto25);
    }
    {
        name  piston;
        patchInfo
        {
            type    patch;
        }
        constructFrom patches;
        patches       (auto4);
    }
    {
        name  liner;
        patchInfo
        {
            type    wall;
        }
        constructFrom patches;
        patches       (auto9 auto11);
    }
    {
        name  frontAndBack;
        patchInfo
        {
            type    empty;
        }
        constructFrom patches;
        patches       (auto28 auto29);
    }
    {
        name  cylinderHead;
        patchInfo
        {
            type    wall;
        }
        constructFrom patches;
        patches       (auto1 auto2 auto3 auto5 auto7 auto12 auto13 auto14
                       auto15 auto16 auto17 auto18 auto21 auto22 auto27 );
    }
);

// ************************************************************************* //
