engineFoam_tutorial/system/extrudeMeshDict_outlet
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

constructFrom   mesh;

sourceCase      "<case>";

sourcePatches   (outlet);

extrudeModel    linearNormal;

nLayers             20;

expansionRatio      1.05;

linearNormalCoeffs
{
    thickness       0.04;
}

linearDirectionCoeffs
{
    direction       (0 1 0);
    thickness       0.05;
}

flipNormals false;

mergeFaces  false;

mergeTol    0;


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
