engineFoam_tutorial/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "p"
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.1;
        smoother        GaussSeidel;
    }
    "cellMotionU|cellMotionUz"
    {
        $p;
        minIter         1;
    }

    "rho|rhoFinal"
    {
        solver          diagonal;
    }

    pFinal
    {
        $p;
        smoother        DICGaussSeidel;
        tolerance       1e-06;
        relTol          0;
    }

    "U|h"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-05;
        relTol          0;
    }

    "(U|h).*Final"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        relTol          0;
    }

    "Yi"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-05;
        relTol          0;
    }

    "YiFinal"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors            2;
    nCorrectors                 2;
    nNonOrthogonalCorrectors    1;
}

relaxationFactors
{
    fields
    {
        p           0.3;
        rho         0.1;
        ".*Final"   1;
    }

    equations
    {
        "U|h|Yi"    0.7;
        ".*Final"   1;
    }
}


// ************************************************************************* //
